
public class Main {

	public static void main(String[] args) {
		// TODO Auto-generated method stub
		new MainMenu();
		// 객체를 만들땐 생성자로 만든다, 생성자도 메서드이다.
		//	SeatMain s = new SeatMain();
		//	s.menu();
		/*
		 *  영화예매 프로그램
		 *
		 *  좌석은 1열, 2열 3열이 있으며 1열은 6, 2열은 8, 3열은 10개이다.
		 *  예매시 이름과 비밀번호를 기록한다.
		 *  예매확인은 이름을 입력하면 예약된 좌석번호와 이름을 확인한다.
		 *   좌석별 예약, 예약가능이 출력되고, 예약일 경우 예약자 성뒤에 **마스킹하여 출력한다.
		 *   수정은 예매자 이름으로 수정이 가능하고 비밀번호만 수정이 가능하다.
		 *  삭제는 예매자 이름으로 검색하여 예매를 취소한다.
		 *  예매시 동일 이름으로는 예약이 불가능하다.
		 *  자리 이동 기능을 추가한다.빈자리를 출력하여 원하는 자리를 선택하고 원하는 자리가 비워 있으면 이동시킨다.
		 *                   빈자리가 아닐 경우 거절한다.
		 *  회원제로 변경하고 메뉴 중 전체보기는 로그인을 안해도 되나, 다른 메뉴는    로그인 후 이용이 가능하다.
		 */
	}
}
